/* No comment provided by engineer. */
"\n         total %@ (%@)" = "\n         всього %1$@ (%2$@)";

/* No comment provided by engineer. */
"\n(local requested amount: %@)" = "\n(в місцевій валюті: %@)";

/* No comment provided by engineer. */
"\n\n     amount %@ (%@)" = "\n\n     сума %1$@ (%2$@)";

/* No comment provided by engineer. */
"\nADDRESS ALREADY USED\nDash addresses are intended for single use only\n\nre-use reduces privacy for both you and the recipient and can result in loss if the recipient doesn't directly control the address" = "\nАДРЕСА ВЖЕ ВИКОРИСТАНА\nАдреси Dash призначені для разового використання\n\nповторне використання адреси знижує приватність як для вас, так і для одержувача і може призвести до втрати коштів, якщо одержувач більше не контролює цю адресу";

/* No comment provided by engineer. */
"\nnetwork fee +%@ (%@)" = "\nкомісія мережі +%1$@ (%2$@)";

/* No comment provided by engineer. */
"Are you sure you would like to reclaim this masternode?" = "Ви впевнені, що хочете використовувати цю мастерноду?";

/* No comment provided by engineer. */
"Are you sure you would like to register a masternode at %@:%d?" = "Ви впевнені, що хочете зареєструвати мастернуду в %1$@:%2$d?";

/* No comment provided by engineer. */
"Are you sure you would like to update this masternode to %@:%d?" = "Ви впевнені, що хочете оновити цю мастернуду на %1$@:%2$d?";

/* No comment provided by engineer. */
"Are you sure you would like to update this masternode to pay to %@?" = "Ви впевнені, що хочете оновити адресу виплат цієї мастерноди на %@?";

/* No comment provided by engineer. */
"Bad password, try again" = "Неправильний пароль, спробуйте ще раз";

/* No comment provided by engineer. */
"Bad payment request" = "Неправильний платіжний запит";

/* No comment provided by engineer. */
"Bad payment request URL" = "Неправильна URL-адреса запиту на платіж";

/* No comment provided by engineer. */
"Bad payment URL" = "Неправильна URL-адреса платежу";

/* No comment provided by engineer. */
"Cancel" = "Відміна";

/* No comment provided by engineer. */
"Confirm" = "Підтверджую";

/* No comment provided by engineer. */
"Confirm PIN" = "Підтвердіть PIN";

/* No comment provided by engineer. */
"Connect timeout" = "Час очікування підключення";

/* No comment provided by engineer. */
"Couldn't make payment" = "Не вдалося здійснити платіж";

/* No comment provided by engineer. */
"Dash payments can't be less than %@" = "Платежі Dash не можуть бути меншими ніж %@";

/* No comment provided by engineer. */
"Dash transaction not signed" = "Транзакція Dash не підписана";

/* No comment provided by engineer. */
"Dash transaction outputs can't be less than %@" = "Виходи транзакцій Dash не можуть бути меншими за %@";

/* No comment provided by engineer. */
"Devnet" = "Devnet";

/* No comment provided by engineer. */
"Double spend" = "Подвійні витрати";

/* The server is not working */
"Down" = "Відключено";

/* No comment provided by engineer. */
"Enter old PIN" = "Введіть старий PIN";

/* No comment provided by engineer. */
"Error from payment request server %@" = "Помилка на сервері платіжних запитів %@";

/* No comment provided by engineer. */
"Error signing transaction" = "Помилка підписання транзакції";

/* No comment provided by engineer. */
"Ignore" = "Ігнорувати";

/* No comment provided by engineer. */
"Insufficient funds" = "Недостатньо коштів";

/* No comment provided by engineer. */
"Insufficient funds for Dash network fee" = "Недостатньо коштів для оплати комісії мережі Dash";

/* No comment provided by engineer. */
"Internal Error" = "Внутрішня помилка";

/* No comment provided by engineer. */
"Invalid DAPI Response" = "Неправильна відповідь DAPI";

/* No comment provided by engineer. */
"Invalid Params" = "Недійсні параметри";

/* No comment provided by engineer. */
"Invalid Request" = "Неправильний запит";

/* No comment provided by engineer. */
"Mainnet" = "Mainnet";

/* No comment provided by engineer. */
"Method Not Found" = "Метод не знайдено";

/* No comment provided by engineer. */
"Missing certificate" = "Відсутній сертифікат";

/* No comment provided by engineer. */
"No attempts remaining" = "Спроб не залишилося";

/* No comment provided by engineer. */
"No peers found" = "Вузли не знайдені";

/* No comment provided by engineer. */
"Not a valid private key" = "Недійсний приватний ключ";

/* No comment provided by engineer. */
"Not connected to the Dash network" = "Не підключено до мережі Dash";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Parse Error" = "Помилка обробки";

/* No comment provided by engineer. */
"Passcode" = "Пароль";

/* No comment provided by engineer. */
"Password" = "Пароль";

/* No comment provided by engineer. */
"Password protected key" = "Ключ, захищений паролем";

/* No comment provided by engineer. */
"Payee identity isn't certified" = "Особа одержувача платежу не підтверджена";

/* No comment provided by engineer. */
"PIN for %@" = "PIN-код для %@";

/* Please authenticate to create your Testnet wallet */
"Please authenticate to create your %@ wallet" = "Пройдіть автентифікацію, щоб створити гаманець %@";

/* No comment provided by engineer. */
"Recovery phrase" = "Фраза відновлення";

/* No comment provided by engineer. */
"Reduce payment amount by\n%@ (%@)?" = "Зменшити суму платежу на\n%1$@ (%2$@)?";

/* No comment provided by engineer. */
"Request expired" = "Термін дії запиту минув";

/* No comment provided by engineer. */
"Requested network \"%@\" not currently in use" = "Запитана мережа \"%@\" зараз не використовується";

/* No comment provided by engineer. */
"Rescan" = "Повторне сканування";

/* No comment provided by engineer. */
"Reset" = "Скидання";

/* No comment provided by engineer. */
"Server Error" = "Помилка сервера";

/* No comment provided by engineer. */
"Set PIN" = "Встановіть PIN";

/* No comment provided by engineer. */
"Testnet" = "Testnet";

/* No comment provided by engineer. */
"This payment address is already in your wallet" = "Ця платіжна адреса вже є у вашому гаманці";

/* No comment provided by engineer. */
"This private key is already in your wallet" = "Цей приватний ключ уже у вашому гаманці";

/* No comment provided by engineer. */
"This private key is empty" = "Цей закритий ключ пустий";

/* No comment provided by engineer. */
"Transaction canceled, network timeout" = "Транзакція скасована, час очікування мережі вийшов";

/* No comment provided by engineer. */
"Transaction fees would cost more than the funds available on this private key (due to tiny \"dust\" deposits)" = "Комісія за цю транзакцію буде більшою, ніж сума на цьому приватному ключі (через маленькі депозити)";

/* No comment provided by engineer. */
"Transaction rejected" = "Транзакцію відхилено";

/* No comment provided by engineer. */
"Try again in %@" = "Спробуйте ще раз через %@";

/* No comment provided by engineer. */
"Unexpected response from %@" = "Несподівана відповідь від %@";

/* No comment provided by engineer. */
"Unknown address" = "Невідома адреса";

/* No comment provided by engineer. */
"Unknown Error" = "Невідома помилка";

/* No comment provided by engineer. */
"Unknown JSON-RPC Response" = "Невідома відповідь JSON-RPC";

/* No comment provided by engineer. */
"Unrecognized address" = "Нерозпізнана адреса";

/* No comment provided by engineer. */
"Unsupported signature type" = "Непідтримуваний тип підпису";

/* No comment provided by engineer. */
"Untrusted certificate" = "Ненадійний сертифікат";

/* The server is up and running */
"Up" = "Працює";

/* Updating Price */
"Updating Price" = "Оновлення ціни";

/* No comment provided by engineer. */
"Wallet disabled" = "Гаманець вимкнено";

/* No comment provided by engineer. */
"WARNING" = "УВАГА";

/* No comment provided by engineer. */
"Wipe" = "Стерти";

/* No comment provided by engineer. */
"Your wallet may be out of sync.\nThis can often be fixed by rescanning the blockchain." = "Можливо, ваш гаманець не синхронізований.\nЧасто це можна виправити повторним скануванням блокчейна.";

/* No comment provided by engineer. */
"Unable to create registration transition" = "Неможливо перейти до реєстрації";

/* The Blockchain Identity is not registered */
"Not Registered" = "Не зареєстровано";

/* The Blockchain Identity is registered */
"Registered" = "Зареєстровано";

/* The Blockchain Identity is being registered */
"Registering" = "Реєстрація";

/* It is Unknown if the Blockchain Identity is registered */
"Unknown" = "Невідомий";

/* Status of Key or Username is Revoked */
"Revoked" = "Анульовано";

/* No comment provided by engineer. */
"BLS" = "BLS";

/* No comment provided by engineer. */
"ECDSA" = "ECDSA";

/* No comment provided by engineer. */
"Unknown Key Type" = "Невідомий тип ключа";

/* No comment provided by engineer. */
"Dashpay Contract is not yet registered on network" = "Контракт DashPay ще не зареєстровано у мережі";

/* No comment provided by engineer. */
"DPNS Contract is not yet registered on network" = "Контракт DPNS ще не зареєстровано у мережі";

/* No comment provided by engineer. */
"Funding transaction could not be created" = "Не вдалося створити трансакцію фінансування";

/* No comment provided by engineer. */
"Internal key handling error" = "Внутрішня помилка обробки ключа";

/* No comment provided by engineer. */
"Internal memory allocation error" = "Помилка розподілу внутрішньої пам'яті";

/* No comment provided by engineer. */
"Malformed platform response" = "Неправильна відповідь платформи";

/* No comment provided by engineer. */
"Timeout while waiting for funding transaction to be accepted by network" = "Перевищено час очікування під час очікування транзакції фінансування, яка буде прийнята мережею";

/* No comment provided by engineer. */
"Transaction could not be signed" = "Не вдалося підписати транзакцію";

/* No comment provided by engineer. */
"Unable to register registration transition" = "Неможливо зареєструвати перехід до реєстрації";

/* No comment provided by engineer. */
"User has actions to complete before being able to use Dashpay" = "Користувач має виконати всі дії, перш ніж матиме змогу використовувати Dashpay";

/* No comment provided by engineer. */
"Unable to sign transition" = "Не вдалося підписати перехід";

/* No comment provided by engineer. */
"Transition had nothing to update" = "Немає доступних оновлень";

/* No comment provided by engineer. */
"Contract '%@' doesn't contain a table named '%@'" = "Контракт '%1$@' не містить таблиці з назвою '%2$@'";

/* No comment provided by engineer. */
"The blockchain identity hasn't yet been locally activated" = "Ідентифікатор блокчейну ще не активовано локально";

/* No comment provided by engineer. */
"The blockchain identity funding private key should be first created with createFundingPrivateKeyWithCompletion" = "Приватний ключ фінансування ідентичності блокчейна спочатку слід створити за допомогою createFundingPrivateKeyWithCompletion";

/* No comment provided by engineer. */
"The blockchain identity extended public keys need to be registered before you can register a blockchain identity." = "Перш ніж ви зможете зареєструвати ідентифікатор блокчейна, потрібно зареєструвати розширені відкриті ключі ідентифікатора блокчейна.";

/* No comment provided by engineer. */
"Contact request extended public key is incorrectly encrypted." = "Розширений відкритий ключ запиту контакту неправильно зашифрований.";

/* No comment provided by engineer. */
"Error generating public keys" = "Помилка генерації публічних ключів";

/* No comment provided by engineer. */
"Accepting a friend request should only happen from a local blockchain identity" = "Прийняття запиту в друзі має відбуватися лише з локального блокчейну";

/* No comment provided by engineer. */
"You can only accept a friend request from blockchain identity who has sent you one, and none were found" = "Прийняти запит на дружбу можна лише всередині того Блокчейну ID, з якого він був відправлений. Таких запитів не знайдено.";

/* An error message for notifying that chain sync has timed out */
"Synchronization Timeout" = "Сплив час очікування синхронізації";

/* No comment provided by engineer. */
"Attempt to query DAPs for blockchain identity with no active keys" = "Спроба запиту DAP для Блокчейн ID без активних ключів";

/* No comment provided by engineer. */
"Node at host %@ does not service network" = "Вузол на хості %@ не обслуговує мережу";

/* No comment provided by engineer. */
"Node at host %@ does not support bloom filtering" = "Вузол на хості %@ не підтримує фільтрацію блума";

/* No comment provided by engineer. */
"The Dashpay contract is not properly set up" = "Договір Dashpay не налаштовано належним чином";

/* No comment provided by engineer. */
"Contract '%@' needs to first be locally registered or known" = "Контракт '%@' має спочатку бути локально зареєстрованим або відомим";

/* No comment provided by engineer. */
"A block could not be mined in the selected time interval." = "Блок не вдалося видобути протягом вибраного інтервалу часу.";

/* No comment provided by engineer. */
"Could not create friendship derivation path" = "Не вдалося створити шлях запиту про дружбу";

/* No comment provided by engineer. */
"Incorrect key format after contact request decryption" = "Неправильний формат ключа після розшифровки запиту контакту";

/* No comment provided by engineer. */
"Error when updating profile information" = "Помилка під час оновлення інформації профілю";

/* No comment provided by engineer. */
"Timeout while waiting for funding transaction to aquire an instant send lock" = "Перевищено час очікування прийняття транзакції фінансування за допомогою InstantSend";

/* No comment provided by engineer. */
"Would you like to share this invitation?" = "Хочете поділитися цим запрошенням?";

/* No comment provided by engineer. */
"Identity no longer active in wallet" = "Id деактивовано у гаманці";

/* No comment provided by engineer. */
"The registration credit funding transaction has not been mined yet and has no instant send lock" = "Необхідна для реєстрації транзакція фінансування ще не включена до блоку та не зафіксована в мережі за допомогою InstantSend";

/* No comment provided by engineer. */
"Transaction does not exist" = "Транзакція не існує";

/* No comment provided by engineer. */
"Invitation format is not valid" = "Формат запрошення недійсний";

/* No comment provided by engineer. */
"Invitation transaction is not valid" = "Транзакція запрошення недійсна";

/* No comment provided by engineer. */
"Funding private key is not valid" = "Приватний ключ фінансування недійсний";

/* No comment provided by engineer. */
"Error setting the external funding private key" = "Помилка налаштування приватного ключа зовнішнього фінансування";
